app/views/posts/show.html.erb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
<%@post = Post.find(params["id"])%>